Week9/B_mixerSimPimple/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.3 -0.3 -0.05)
    (0.3 -0.3 -0.05)
    (0.3  0.3 -0.05)
    (-0.3  0.3 -0.05)
    (-0.3 -0.3  0.55)
    (0.3 -0.3  0.55)
    (0.3  0.3  0.55)
    (-0.3  0.3  0.55)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (15 15 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    defaultFaces
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
);

// ************************************************************************* //
